In [1]:
import pandas as pd

In [2]:
data = {
    "a": [1,2,3,4],
    "b":[4,5,6,7],
    "c":["sudh","krish","hitesh","navin"]
}

In [3]:
data

{'a': [1, 2, 3, 4],
 'b': [4, 5, 6, 7],
 'c': ['sudh', 'krish', 'hitesh', 'navin']}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [9]:
df.set_index('c',inplace=True)

In [10]:
df

        a  b
c
sudh    1  4
krish   2  5
hitesh  3  6
navin   4  7

In [11]:
df.reset_index()

        c  a  b
0    sudh  1  4
1   krish  2  5
2  hitesh  3  6
3   navin  4  7

In [12]:
data = {
    "a": [1,2,3,4],
    "b":[4,5,6,7],
    "c":["sudh","krish","hitesh","navin"]
}
df1 = pd.DataFrame(data,index=['a','b','c','d'])

In [13]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [14]:
df1.reindex(['b','c','a','d'])

   a  b       c
b  2  5   krish
c  3  6  hitesh
a  1  4    sudh
d  4  7   navin

In [15]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [18]:
for i in df.iterrows():
    print(i)

('sudh', a    1
b    4
Name: sudh, dtype: int64)
('krish', a    2
b    5
Name: krish, dtype: int64)
('hitesh', a    3
b    6
Name: hitesh, dtype: int64)
('navin', a    4
b    7
Name: navin, dtype: int64)

In [20]:
for i in df1.items():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object)

In [21]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [22]:
def test(x):
    return x.sum()
df1.apply(test,axis=0)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [23]:
df2 = df1[['a','b']]
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [28]:
df2.applymap(lambda x:x**2)

/var/folders/4g/s2v2w1ss3rg_7tlm4knj031c0000gn/T/ipykernel_96072/970338435.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x:x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [26]:
df2.map(lambda x:x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [29]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [30]:
df1.sort_values('c')

   a  b       c
c  3  6  hitesh
b  2  5   krish
d  4  7   navin
a  1  4    sudh

In [33]:
df1.sort_index(ascending=False)

   a  b       c
d  4  7   navin
c  3  6  hitesh
b  2  5   krish
a  1  4    sudh

In [41]:
pd.set_option("display.max_colwidth",1000)
df3 = pd.DataFrame({"desc": ["One of the oldest civilisations in the world, India is a mosaic of multicultural experiences. With a rich heritage and myriad attractions, the country is among the most popular tourist destinations in the world. It covers an area of 32, 87,263 sq. km, extending from the snow-covered Himalayan heights to the tropical rain forests of the south. As the 7th largest country in the world, India stands apart from the rest of Asia, marked off as it is by mountains and the sea, which give the country a distinct geographical entity.","today is a beautiful day"]})

In [42]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               desc
0  One of the oldest civilisations in the world, India is a mosaic of multicultural experiences. With a rich heritage and myriad attractions, the country is among the most popular tourist destinations in the world. It covers an area of 32, 87,263 sq. km, extending from the snow-covered Himalayan heights to the tropical rain forests of the south. As the 7th largest country in the world, India stands apart from the rest of Asia, marked off as it is by mountains and the sea, which give the country a distinct geographical entity.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          today is a beautiful day

In [43]:
df3['char_len_data'] = df3['desc'].apply(len)

In [44]:
df3

,desc,char_len_data
0,"One of the oldest civilisations in the world, India is a mosaic of multicultural experiences. With a rich heritage and myriad attractions, the country is among the most popular tourist destinations in the world. It covers an area of 32, 87,263 sq. km, extending from the snow-covered Himalayan heights to the tropical rain forests of the south. As the 7th largest country in the world, India stands apart from the rest of Asia, marked off as it is by mountains and the sea, which give the country a distinct geographical entity.",528
1,today is a beautiful day,24

In [45]:
t = 'today is a beautiful day'
t.split()

['today', 'is', 'a', 'beautiful', 'day']

In [46]:
len(t.split())

5

In [47]:
df3['word_count'] = df3['desc'].apply(lambda x:len(x.split()))
df3

,desc,char_len_data,word_count
0,"One of the oldest civilisations in the world, India is a mosaic of multicultural experiences. With a rich heritage and myriad attractions, the country is among the most popular tourist destinations in the world. It covers an area of 32, 87,263 sq. km, extending from the snow-covered Himalayan heights to the tropical rain forests of the south. As the 7th largest country in the world, India stands apart from the rest of Asia, marked off as it is by mountains and the sea, which give the country a distinct geographical entity.",528,91
1,today is a beautiful day,24,5

In [48]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [50]:
df1['a'].mean()

2.5

In [52]:
df1['a'].median()

2.5

In [53]:
df1['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [54]:
df1['a'].std()

1.2909944487358056

### Window Functions

In [55]:
df4 = pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9]})

In [56]:
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [57]:
# rolling window 
df4.rolling(window=1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [58]:
df4.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [59]:
df4.rolling(window=3).mean()

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [60]:
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45

### Date Functionality

In [61]:
data = pd.date_range(start='2022-03-22', end='2022-06-22')
data

DatetimeIndex(['2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10',
               '2022-04-11', '2022-04-12', '2022-04-13', '2022-04-14',
               '2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30',
               '2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12',
               '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20',
               '2022-05-21', '2022-05-22', '2022-05-23', '2022-05-24',
               '2022-05-25', '2022-05-26', '2022-05-27', '2022-05-28',
               '2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12', '2022-06-13',
               '2022-06-14', '2022-06-15', '2022-06-16', '2022-06-17',
               '2022-06-18', '2022-06-19', '2022-06-20', '2022-06-21',
               '2022-06-22'],
              dtype='datetime64[ns]', freq='D')

In [63]:
df_date = pd.DataFrame({"date":data})

In [64]:
df_date

         date
0  2022-03-22
1  2022-03-23
2  2022-03-24
3  2022-03-25
4  2022-03-26
..        ...
88 2022-06-18
89 2022-06-19
90 2022-06-20
91 2022-06-21
92 2022-06-22

[93 rows x 1 columns]

In [65]:
df_date.dtypes

date    datetime64[ns]
dtype: object

In [66]:
df5  =pd.DataFrame({"date":['2022-06-22','2022-06-21','2022-06-19']})

In [67]:
df5

         date
0  2022-06-22
1  2022-06-21
2  2022-06-19

In [68]:
df5.dtypes

date    object
dtype: object

In [70]:
df5['update_date']=pd.to_datetime(df5['date'])

In [71]:
df5

         date update_date
0  2022-06-22  2022-06-22
1  2022-06-21  2022-06-21
2  2022-06-19  2022-06-19

In [72]:
df5.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [74]:
df5['year'] = df5['update_date'].dt.year

In [75]:
df5

         date update_date  year
0  2022-06-22  2022-06-22  2022
1  2022-06-21  2022-06-21  2022
2  2022-06-19  2022-06-19  2022

In [76]:
df5['month'] = df5['update_date'].dt.month
df5

         date update_date  year  month
0  2022-06-22  2022-06-22  2022      6
1  2022-06-21  2022-06-21  2022      6
2  2022-06-19  2022-06-19  2022      6

In [77]:
df5['day'] = df5['update_date'].dt.day
df5

         date update_date  year  month  day
0  2022-06-22  2022-06-22  2022      6   22
1  2022-06-21  2022-06-21  2022      6   21
2  2022-06-19  2022-06-19  2022      6   19

### Time Delta

In [80]:
time = pd.Timedelta(days=1,hours=5,minutes=15)

In [81]:
date = pd.to_datetime('2022-06-22')

In [82]:
date

Timestamp('2022-06-22 00:00:00')

In [83]:
date + time

Timestamp('2022-06-23 05:15:00')